package classes.data
{
//-----------------------------------------------------------------------------
//
//  Imports
//
//-----------------------------------------------------------------------------
/**
 *  어플리케이션 내에 싱글톤 데이터 관리 클래스
 * 
 *  @author	야훔(igna84@gmail.com)
 *  @since	2010.06.22
 */
public class ApplicationData
{
	//-----------------------------------------------------------------------------
	//
	//  Constructor.
	//
	//-----------------------------------------------------------------------------
	/**
	 *  Constructor.
	 */
	public function ApplicationData()
	{
		if(instance)
		{
			throw ( new Error("인스턴스가 이미 생성되어있음"));
			
		}
	}
	
	//-----------------------------------------------------------------------------
	//
	//  Variables
	//
	//-----------------------------------------------------------------------------
	/**
	 *  @private
	 *  인스턴스
	 */
	private static var instance:ApplicationData;
	
	//-----------------------------------------------------------------------------
	//
	//  Methods : Static
	//
	//-----------------------------------------------------------------------------
	/**
	 *  <p>ApplicationData의 인스턴스를 반환받는 static 메서드</p>
	 *  <p>싱글톤 디자인 패턴을 구현하기 위해 작성된 메서드</p>
	 * 
	 *  @return ApplicationData 
	 */
	public static function getInstance():ApplicationData
	{
		if(!instance)
		{
			instance = new ApplicationData();
		}
		
		return instance;
	}
	
	//-----------------------------------------------------------------------------
	//
	//  Sigle tone Data : Properties
	//
	//-----------------------------------------------------------------------------
	//-----------------------------------------------------------------------------
	//
	//  Sigle tone Data : Methods
	//
	//-----------------------------------------------------------------------------
	
}
}